app/controllers/books_controller.rb

	def create
		@book = Book.new(book_params)
		@book.user_id = current_user.id
		if @book.save
			flash[:notice] = " You have creatad book successfully."
		    redirect_to book_path(@book)
	    else
	    	@books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id") VALUES (?, ?, ?)  [["title", "人を動かす"], ["body", "とても刺激的で良い本でした。"], ["user_id", 1]]
SELECT "books".* FROM "books"